@echo off
:: -----------------------------------------------
:: Language:    Ukrainian
:: Author:      iCCup.Arty.404 (prom.arty404@gmail.com)
:: -----------------------------------------------
:: Code Page:   ?
:: Encoding:    ?


set PHRASE_0_0 = ^ ^! ^ ^! ^ ^! УВАГА ^ ^! ^ ^! ^ ^! 
set PHRASE_0_1 = Magic Builder повинен розміщуватися на шляху без пробілів, російських і спеціальних символів (_. - дозволені). 
set PHRASE_0_2 = Наприклад:% 2 
 
set PHRASE_1_0 = Visual Studio не завантажена 
set PHRASE_1_1 = Виберіть версію Visual Studio для компіляції PvPGN: 
set PHRASE_1_2 =% 2 обрана в якості компілятора 
set PHRASE_1_3 = Завантажити / замінити останні вихідні коди PvPGN з GIT (в папку% 2)? 
set PHRASE_1_4 = PvPGN буде оновлено з GIT 
set PHRASE_1_5 = PvPGN НЕ буде оновлено 
set PHRASE_1_6 = Виберіть інтерфейс для PvPGN: 
set PHRASE_1_7 = 1) Консольний (по-замовчуванням) 
set PHRASE_1_8 = 2) Віконний 
set PHRASE_1_9 = Введіть номер 
set PHRASE_1_10 = Для PvPGN обраний консольний інтерфейс 
set PHRASE_1_11 = Для PvPGN обраний віконний інтерфейс 
set PHRASE_1_12 = Виберіть тип бази даних: 
set PHRASE_1_13 = 1) Текстові файли / CDB (по-замовчуванням) 
set PHRASE_1_14 = 
set PHRASE_1_15 = PvPGN буде зібраний без підтримки бази даних 
set PHRASE_1_16 = При конфігурації CMake виникли помилки 
 
set PHRASE_2_1 = Доступні версії% 2 (можна додати свою у% 3): 
set PHRASE_2_2 = Введіть номер 
set PHRASE_2_3 = Неправильний номер ... спробуйте ще раз 
set PHRASE_2_4 = PvPGN буде зібраний із підтримкою% 2 v% 3 
set PHRASE_2_5 = Змінити зараз настройки для% 2 (bnetd.conf ^> storage_path)? 
set PHRASE_2_6 = Адреса сервера (хост) 
set PHRASE_2_7 = Користувач 
set PHRASE_2_8 = Пароль 
set PHRASE_2_9 = Назва бази даних 
set PHRASE_2_10 = Префікс для таблиць (по-замовчуванням% 2): 
set PHRASE_2_11 = Конфігурація% 2 збережена у% 2.conf.bat 
 
set PHRASE_3_1 = Перевірка оновлень ... 
set PHRASE_3_2 = "v% 2" ваша версія 
set PHRASE_3_3 = "v% 2" остання версія 
set PHRASE_3_4 = У вас останній PvPGN Magic Builder 
set PHRASE_3_5 = Версія PvPGN Magic Builder на сервері не збігається з вашою. Хочете автоматично оновитися до останньої версії? 
set PHRASE_3_6 = Оновлення скасовано користувачем 
set PHRASE_3_6_1 = Немає з'єднання з сервером оновлень 
set PHRASE_3_7 = Починаю оновлення ... 
set PHRASE_3_8 = Завантаження файлу% 2 ... 
set PHRASE_3_9 = Оновлення завершено 
set PHRASE_3_10 = Інформацію про зміни можна подивитися у файлі% 2 
 
set PHRASE_4_1 = Включити підтримку Lua скриптів? 
set PHRASE_4_2 = PvPGN буде скомпільовано з Lua 
set PHRASE_4_3 = PvPGN буде скомпільовано без Lua 
 
set PHRASE_9_1 = Виберіть версію D2GS: 
set PHRASE_9_2 = Встановіть пароль адміна для Telnet з'єднання (працює на порту 8888), буде збережений в d2gs.reg 
set PHRASE_9_3 = Хеш пароля буде збережений у файлі% 2 
set PHRASE_9_4 = Ви хочете завантажити MPQ файли, необхідні для роботи сервера? (розмір 1ГБ) 
set PHRASE_9_9 = ^ ^! ^ ^! ^ ^! Для завершення установки D2GS змініть d2gs.reg і запустіть install.bat ^ ^! ^ ^! ^ ^!
